{"which.word":"which","which.translation[0].definitions[0].definition":"used to ask or talk about one or more members of a group of people or things, when you are uncertain about it or about them","which.translation[0].definitions[0].example[0].text":"Which book are you looking for?","which.translation[0].definitions[0].example[1].text":"Which are the most important crops?","which.translation[0].definitions[0].example[2].text":"Miranda was sure it was one of them, but was not sure which.","which.translation[0].definitions[0].example[3].text":"I don’t know which of us was the more scared.","which.translation[0].definitions[0].example[3].note.text":"which of","which.translation[0].definitions[1].definition":"used after a noun to show what thing or things you mean","which.translation[0].definitions[1].example[0].text":"Did you see the letter which came today?","which.translation[0].definitions[1].example[1].text":"Now they were driving by the houses which Andy had described.","which.translation[0].definitions[2].definition":"used, after a comma in writing, to add more information about the thing, situation, or event you have just mentioned","which.translation[0].definitions[2].example[0].text":"The house, which was completed in 1856, was famous for its huge marble staircase.","which.translation[0].definitions[2].example[1].text":"One of the boys kept laughing, which annoyed Jane intensely.","which.translation[0].definitions[2].example[2].text":"He was educated at the local grammar school, after which he went on to Cambridge.","which.translation[0].definitions[2].example[3].text":"She may have missed the train, in which case (=if this has happened) she won’t arrive for another hour.","which.translation[1].definitions[0].definition":"a British magazine that tests products made by different companies and provides reports on them to help people decide which one to buy. Which? is known for providing useful information that can be trusted. There is a similar magazine in the US called Consumer Reports."}