{"straddle.word":"straddle","straddle.translation[0].definitions[0].definition":"to sit or stand with your legs on either side of someone or something","straddle.translation[0].definitions[0].example[0].text":"The photo shows him dressed in leather, straddling a motorbike.","straddle.translation[0].definitions[1].definition":"if something straddles a line, road, or river, part of it is on one side and part on the other side","straddle.translation[0].definitions[1].example[0].text":"Mount Elgon straddles the border between Kenya and Uganda.","straddle.translation[0].definitions[1].example[0].note.text":"straddle something between something","straddle.translation[0].definitions[2].definition":"to include different areas of activity, groups, time etc","straddle.translation[0].definitions[2].example[0].text":"Her research straddles mathematics and social sciences.","straddle.translation[0].definitions[2].example[1].text":"immigrants straddling two cultures","straddle.translation[1].definitions[0].definition":"a combination of CALL OPTIONs (=rights to buy particular shares at a fixed price within a certain period of time) and PUT OPTIONs (=rights to sell particular shares at a fixed price within a certain period of time) relating to the same shares and with the same EXERCISE PRICE. The holder of a straddle makes a profit if the share price goes up or down by a large amount during the life of the options","straddle.translation[1].definitions[0].example[0].text":"One investor bought 400 lots of the November 425p puts and calls at 50p each to set up a straddle which would be profitable if the underlying shares move out of a small trading range.","straddle.translation[1].definitions[1].definition":"a situation where someone buys FINANCIAL FUTUREs or COMMODITIES FUTURES with different delivery dates","straddle.translation[1].definitions[1].example[0].text":"Straddle investments, where an investor reduces risk by buying a contract of one month and selling the contract of another, are popular with producers and consumers of commodities."}