{"format.word":"format","format.translation[0].definitions[0].definition":"the way in which something such as a television show or meeting is organized or arranged","format.translation[0].definitions[0].example[0].text":"The courses were run to a consistent format.","format.translation[0].definitions[1].definition":"the size, shape, design etc in which something such as a book or magazine is produced","format.translation[0].definitions[1].example[0].text":"a large-format book for the partially-sighted","format.translation[0].definitions[2].definition":"the way in which information is stored on a computer","format.translation[0].definitions[3].definition":"the type of equipment that an MP3 file, DVD, or piece of computer software etc is designed to use","format.translation[1].definitions[0].definition":"to organize the space on a computer disk so that information can be stored on it","format.translation[1].definitions[1].definition":"to arrange the pages of a book or the information on a computer etc into a particular design","format.translation[1].definitions[1].example[0].text":"better ways to format your spreadsheets","format.translation[2].definitions[0].definition":"the way in which information is arranged and stored in a computer file or on a DISK. If the format is not right, a computer will not be able to read the information","format.translation[2].definitions[0].example[0].text":"The firm markets software that automatically converts data from one computer format to another.","format.translation[2].definitions[1].definition":"the size, shape, and design in which a book or magazine is produced","format.translation[2].definitions[1].example[0].text":"A larger format often means an increase in price.","format.translation[2].definitions[2].definition":"a way of organizing, arranging or presenting something","format.translation[2].definitions[2].example[0].text":"The stores face competition from other retailers using the megastore format.","format.translation[2].definitions[2].example[1].text":"News stations are searching for a new format that holds viewers and attracts the younger audience that advertisers seek.","format.translation[3].past_tense":"formatted","format.translation[3].past_participle":"formatted","format.translation[3].definitions[0].definition":"to put an instruction into a computer in order to prepare a DISK so that information can be stored on it in a way that the computer can read it","format.translation[3].definitions[0].example[0].text":"You’ll need toformat the disk before you can copy the files across.","format.translation[3].definitions[1].definition":"to arrange information in a computer file, for example using particular software or a particular type of writing, page size etc","format.translation[3].definitions[1].example[0].text":"Documents are generally formatted for A4.","format.translation[3].definitions[1].example[1].text":"The documents are all formatted in WordPerfect.","format.translation[3].definitions[1].example[1].note.text":"format in","format.translation[3].definitions[2].definition":"to arrange a book, magazine, or page according to a particular design","format.translation[3].definitions[2].example[0].text":"The text has not been very well formatted."}