{"charter.word":"charter","charter.translation[0].definitions[0].definition":"a statement of the principles, duties, and purposes of an organization","charter.translation[0].definitions[0].example[0].text":"the freedoms embodied in the UN charter","charter.translation[0].definitions[1].definition":"the practice of paying money to a company to use their boats, aircraft etc, or the boat, aircraft etc used in this way","charter.translation[0].definitions[1].example[0].text":"boats available for charter","charter.translation[0].definitions[1].example[1].text":"a charter service","charter.translation[0].definitions[2].definition":"a signed statement from a government or ruler which allows a town, organization, or university to officially exist and have special rights","charter.translation[0].definitions[2].example[0].text":"The town’s charter was granted in 1838.","charter.translation[0].definitions[3].definition":"a law or official decision that seems to give someone the right to do something most people consider morally wrong","charter.translation[0].definitions[3].example[0].text":"Reducing the number of police is just a thieves’ charter.","charter.translation[1].definitions[0].definition":"to pay a company for the use of their aircraft, boat etc","charter.translation[1].definitions[0].example[0].text":"We chartered a boat to take us to some of the smaller islands.","charter.translation[1].definitions[1].definition":"to say officially that a town, organization, or university officially exists and has special rights","charter.translation[2].definitions[0].definition":"to pay for the use of a plane, boat, train etc for a particular period of time or a particular journey","charter.translation[2].definitions[0].example[0].text":"The US government has chartered 41 commercial vessels to carry equipment to the Mideast.","charter.translation[2].definitions[1].definition":"to officially allow a financial institution to operate in a particular place","charter.translation[2].definitions[1].example[0].text":"Banks chartered in Delaware are allowed to act as insurers.","charter.translation[3].definitions[0].definition":"an arrangement in which a person or organization pays a company to use its ships, aircraft etc","charter.translation[3].definitions[0].example[0].text":"Two of its ships were being repaired and unavailable for charter.","charter.translation[3].definitions[0].example[1].text":"Charter rates (=rates charged for charter) for oil tankers have risen to more than $50,000 a day.","charter.translation[3].definitions[0].example[2].text":"No ship without a charter party (=official contract between the owner and the user) could be loaded.","charter.translation[3].definitions[1].definition":"in the US, an official document that allows a business to operate and controls its activities","charter.translation[3].definitions[1].example[0].text":"The company was granted a New York state charter.","charter.translation[3].definitions[2].definition":"a statement of the principles, duties, and aims of an organization","charter.translation[3].definitions[2].example[0].text":"The signing of the United Nations Charter took place in San Francisco on 26 June 1945.","charter.translation[3].definitions[2].example[1].text":"the review of the BBC’s charter"}