{"rollover.word":"rollover","rollover.translation[0].definitions[0].definition":"when money is moved from one bank account or investment to another without any tax or other fees having to be paid","rollover.translation[0].definitions[0].example[0].text":"Many CD rollovers happen in October.","rollover.translation[0].definitions[1].definition":"the action of making a bank account, investment etc do this","rollover.translation[0].definitions[1].example[0].text":"The law allows a rollover of retirement money from a company pension to an IRA.","rollover.translation[0].definitions[1].example[0].note.text":"rollover of","rollover.translation[0].definitions[2].definition":"if there is a rollover in a competition or lottery, nobody wins the biggest prize that week, and the money is added to the prize that can be won the following week","rollover.translation[0].definitions[3].definition":"an accident in which a car turns over onto its roof","rollover.translation[0].definitions[4].definition":"a way of making the images change whenever someone using a MOUSE moves it over a particular word or picture on a computer screen","rollover.translation[1].definitions[0].definition":"an occasion when an investment is moved from one financial institution to another without being taxed","rollover.translation[1].definitions[0].example[0].text":"a direct rollover of retirement funds from your former employer to a new pension","rollover.translation[1].definitions[1].definition":"when a loan etc that ends in one period of time is replaced by a similar loan etc in the following period","rollover.translation[1].definitions[1].example[0].text":"continued rollover of maturing commercial paper","rollover.translation[1].definitions[2].definition":"an occasion when a company changes the products that it sells","rollover.translation[1].definitions[2].example[0].text":"The new series of machines comes just 10 months after the last rollover of the product line.","rollover.translation[1].definitions[3].definition":"a way of making an image change or appear whenever someone uses the MOUSE to move the CURSOR over a particular word or picture on a computer screen"}