{"organize.word":"organize","organize.translation[0].definitions[0].definition":"to make the necessary arrangements so that an activity can happen effectively","organize.translation[0].definitions[0].example[0].text":"The course was organized by a training company.","organize.translation[0].definitions[0].example[1].text":"Students need to learn how to organize their work.","organize.translation[0].definitions[1].definition":"to manage a group of people who are doing something","organize.translation[0].definitions[1].example[0].text":"The lawyer helped to organize a group of parents who took action for their children.","organize.translation[0].definitions[1].example[1].text":"The scientists need to organize themselves and work as a team.","organize.translation[0].definitions[1].example[1].note.text":"organize yourself","organize.translation[0].definitions[2].definition":"to arrange something so that it is more ordered or happens in a more sensible way","organize.translation[0].definitions[2].example[0].text":"He doesn’t need you to organize his life for him.","organize.translation[0].definitions[2].example[1].text":"Organize yourself to arrive at places on time.","organize.translation[0].definitions[3].definition":"to arrange things in a particular order or pattern","organize.translation[0].definitions[3].example[0].text":"We are learning about how genes are organized.","organize.translation[0].definitions[4].definition":"to form a trade union or persuade people to join one","organize.translation[0].definitions[4].example[0].text":"The law gives workers the right to organize and bargain collectively.","organize.translation[1].definitions[0].definition":"to plan and arrange an event or other activity","organize.translation[1].definitions[0].example[0].text":"Publishers, writers and booksellers are joining forces to organize alternative distribution networks.","organize.translation[1].definitions[1].definition":"to arrange work, information, a group etc so that it works correctly and is useful","organize.translation[1].definitions[1].example[0].text":"Accountants say that organizing paperwork first can reduce errors and cut the costs of tax preparation.","organize.translation[1].definitions[1].example[1].text":"a major change in the way banks are organized and regulated","organize.translation[1].definitions[2].definition":"to form a UNION (=an organization that protects workers’ rights) or to persuade people to join one","organize.translation[1].definitions[2].example[0].text":"The talk helped the union organize 2,300 clerical workers at the University of Illinois.","organize.translation[1].definitions[2].example[1].text":"The company had violated federal labor law by denying workers the right to organize."}