{"leverage.word":"leverage","leverage.translation[0].definitions[0].definition":"influence that you can use to make people do what you want","leverage.translation[0].definitions[0].example[0].text":"diplomatic leverage by the US","leverage.translation[0].definitions[1].definition":"the action, power, or use of a lever","leverage.translation[1].definitions[0].definition":"to make money available to someone in order to invest or to buy something such as a company","leverage.translation[1].definitions[0].example[0].text":"the use of public funds to leverage private investment","leverage.translation[1].definitions[1].definition":"to spread or use resources (=money, skills, buildings etc that an organization has available), ideas etc again in several different ways or in different parts of a company, system etc","leverage.translation[1].definitions[1].example[0].text":"Reusable software is leveraged across many applications.","leverage.translation[1].definitions[1].example[0].note.text":"leverage something across something","leverage.translation[2].definitions[0].definition":"the influence that one person or organization has on another","leverage.translation[2].definitions[0].example[0].text":"It uses its considerable economic leverage to influence other nations.","leverage.translation[2].definitions[1].definition":"the amount of borrowing that a company has in relation to its SHARE CAPITAL (=the money it has from selling its shares). If the company makes more profit by investing this borrowed money in its business activities than it pays in interest, the company’s shareholders will obtain higher payments from their shares. But if the company makes less profit than it pays in interest, shareholders will receive less money","leverage.translation[2].definitions[1].example[0].text":"The company has reduced its leverage, primarily through asset sales.","leverage.translation[2].definitions[1].example[1].text":"a warning to investors about the risks of high leverage","leverage.translation[2].definitions[1].example[2].text":"Heavy leverage and aggressive expansion made for a weak balance sheet.","leverage.translation[3].definitions[0].definition":"to use borrowed money to buy a particular company or investment","leverage.translation[3].definitions[0].example[0].text":"Their capacity to leverage private capital in support of these projects has been variable."}