{"juggle.word":"juggle","juggle.translation[0].definitions[0].definition":"to keep three or more objects moving through the air by throwing and catching them very quickly","juggle.translation[0].definitions[0].example[0].text":"One guy was juggling with five balls.","juggle.translation[0].definitions[0].example[0].note.text":"juggle with","juggle.translation[0].definitions[1].definition":"to try to fit two or more jobs, activities etc into your life, especially with difficulty","juggle.translation[0].definitions[1].example[0].text":"It’s hard trying to juggle a job with kids and the housework.","juggle.translation[0].definitions[1].example[0].note.text":"juggle something (with something)","juggle.translation[0].definitions[2].definition":"to change things or arrange them in the way you want, or in a way that makes it possible for you to do something","juggle.translation[0].definitions[2].example[0].text":"If I juggle these appointments around, I can fit you in.","juggle.translation[0].definitions[2].example[0].note.text":"juggle something around","juggle.translation[1].definitions[0].definition":"to buy and sell different investments frequently in order to make as much profit as possible","juggle.translation[1].definitions[0].example[0].text":"Traders juggle stock and options to maximize profits from temporary price differences.","juggle.translation[1].definitions[0].example[1].text":"Some investors juggle between stocks, bonds and cash in search of high returns with moderate risks.","juggle.translation[1].definitions[1].definition":"if you juggle numbers or figures, you present them in a different way so that they show different things or have a different effect","juggle.translation[1].definitions[1].example[0].text":"After juggling the figures, the Commerce Department now says GNP rose by only 1.4% in the third quarter.","juggle.translation[1].definitions[2].definition":"if you juggle two jobs or activities, you try to fit them both into your life","juggle.translation[1].definitions[2].example[0].text":"Many women successfully juggle career and family."}