{"sponsor.word":"sponsor","sponsor.translation[0].definitions[0].definition":"a person or company that pays for a show, broadcast, sports event etc, especially in exchange for the right to advertise at that event","sponsor.translation[0].definitions[0].example[0].text":"corporate sponsors","sponsor.translation[0].definitions[0].example[1].text":"Eastman Kodak is a major sponsor of the Olympics.","sponsor.translation[0].definitions[0].example[1].note.text":"sponsor of","sponsor.translation[0].definitions[1].definition":"a person or company that supports someone by paying for their training, education, living costs etc","sponsor.translation[0].definitions[2].definition":"someone who agrees to give someone else money for a charity if they walk, run etc a particular distance","sponsor.translation[0].definitions[3].definition":"someone who officially introduces or supports a proposal for a new law","sponsor.translation[0].definitions[4].definition":"someone who officially agrees to help someone else, or to be responsible for what they do","sponsor.translation[0].definitions[4].example[0].text":"You cannot get a work visa without an American sponsor.","sponsor.translation[0].definitions[5].definition":"a godparent","sponsor.translation[1].definitions[0].definition":"to give money to a sports event, theatre, institution etc, especially in exchange for the right to advertise","sponsor.translation[1].definitions[0].example[0].text":"The competition was sponsored by British Airways.","sponsor.translation[1].definitions[0].example[1].text":"government-sponsored projects","sponsor.translation[1].definitions[1].definition":"to support someone by paying for their training, education, living costs etc","sponsor.translation[1].definitions[1].example[0].text":"The bank had offered to sponsor him at university.","sponsor.translation[1].definitions[2].definition":"to officially support a proposal for a new law","sponsor.translation[1].definitions[3].definition":"to agree to help someone or be responsible for what they do","sponsor.translation[1].definitions[4].definition":"to agree to give someone money for charity if they walk, run etc a particular distance","sponsor.translation[2].definitions[0].definition":"to give money to pay for a television programme, a sports or arts event, training etc, in exchange for advertising or to get public attention","sponsor.translation[2].definitions[0].example[0].text":"The insurance company sponsored the charity’s first TV campaign.","sponsor.translation[2].definitions[0].example[1].text":"Some of the students are sponsored by engineering firms.","sponsor.translation[2].definitions[0].example[2].text":"a government-sponsored scheme","sponsor.translation[2].definitions[1].definition":"to officially support a proposal or suggestion","sponsor.translation[2].definitions[1].example[0].text":"The report was sponsored by 12 top companies.","sponsor.translation[3].definitions[0].definition":"a person or company that pays for a television programme, a sports or arts event, training etc, in exchange for advertising or to get public attention","sponsor.translation[3].definitions[0].example[0].text":"The exhibition organizers are now looking for sponsors.","sponsor.translation[3].definitions[1].definition":"someone who officially introduces or supports a proposal or suggestion"}