{"offset.word":"offset","offset.translation[0].past_tense":"offset","offset.translation[0].past_participle":"offset","offset.translation[0].definitions[0].definition":"if the cost or amount of something offsets another cost or amount, the two things have an opposite effect so that the situation remains the same","offset.translation[0].definitions[0].example[0].text":"Cuts in prices for milk, butter, and cheese will be offset by direct payments to farmers.","offset.translation[0].definitions[0].example[1].text":"He was able to offset his travel expenses against tax.","offset.translation[0].definitions[0].example[1].note.text":"offset something against something","offset.translation[0].definitions[1].definition":"to make something look better by being close to it and different","offset.translation[0].definitions[1].example[0].text":"His blonde hair offset a deep tan.","offset.translation[0].definitions[2].definition":"to do something that will make an action or activity carbon neutral﻿","offset.translation[0].definitions[2].example[0].text":"If you have to travel by air, offset your carbon emissions by supporting renewable energy projects.","offset.translation[1].definitions[0].definition":"relating to a method of printing in which ink is put onto rollers and the paper then passes between the rollers","offset.translation[2].past_tense":"offset","offset.translation[2].past_participle":"offset","offset.translation[2].definitions[0].definition":"if something such as a cost or sum of money offsets another cost etc, it has the effect of reducing or balancing it, so that the situation remains the same","offset.translation[2].definitions[0].example[0].text":"He expects the fourth quarter to be profitable, though not profitable enough to offset losses earlier in the year.","offset.translation[2].definitions[0].example[1].text":"The cost of the flight was offset by the cheapness of the hotel.","offset.translation[2].definitions[0].example[2].text":"He was able to offset his travel expenses against tax.","offset.translation[2].definitions[0].example[2].note.text":"offset something against something","offset.translation[3].definitions[0].definition":"the legal right of a bank to take money from a customer’s bank account if a loan has not been paid","offset.translation[3].definitions[1].definition":"an amount of money recorded on one side of a LEDGER (=financial record) that is equal to an amount on the opposite side of the same ledger, or is equal to an amount recorded in the ledger for a different account","offset.translation[3].definitions[2].definition":"in international trade, a quantity of goods that is exported in exchange for a quantity of goods that has been imported","offset.translation[3].definitions[2].example[0].text":"Some government purchases are paid for by offsets."}