{"call in.word":"call in","call in.translation[0].definitions[0].definition":"to ask someone to come and help you with a difficult situation","call in.translation[0].definitions[0].example[0].text":"The government then called in troops to deal with the disturbances.","call in.translation[0].definitions[1].definition":"to telephone somewhere, especially the place where you work, to tell them where you are, what you are doing etc","call in.translation[0].definitions[1].example[0].text":"Rachael called in sick (=telephoned to say she was too ill to come to work).","call in.translation[0].definitions[2].definition":"to telephone a radio or television show to give your opinion or to ask a question","call in.translation[0].definitions[2].example[0].text":"Over 2,000 viewers called in with complaints about the bad language used in the programme.","call in.translation[0].definitions[3].definition":"to officially tell someone to pay back money you lent them","call in.translation[0].definitions[3].example[0].text":"The bank can call in the loan at any time.","call in.translation[0].definitions[4].definition":"to visit a person or place while you are on your way to somewhere else","call in.translation[0].definitions[4].example[0].text":"Could you call in on Mum on your way home?","call in.translation[0].definitions[4].example[0].note.text":" on/at","call in.translation[1].definitions[0].definition":"a radio or television programme in which people telephone to give their opinions","call in.translation[1].definitions[0].example[0].text":"a call-in talk show","call in.translation[2].definitions[0].definition":"to ask for someone in authority to come and deal with a situation","call in.translation[2].definitions[0].example[0].text":"The company called in a team of experts to help it sort out its problems.","call in.translation[2].definitions[0].example[1].text":"The hotel had been experiencing financial difficulties, and the receivers were called in.","call in.translation[2].definitions[1].definition":"to ask for money that you have lent to be repaid","call in.translation[2].definitions[1].example[0].text":"The company continued to trade at a loss and the bank decided to call in its loan.","call in.translation[2].definitions[2].definition":"to telephone somewhere, especially the place where you work, to tell them what you are doing or where you are","call in.translation[2].definitions[2].example[0].text":"During the break I called in to the office.","call in.translation[2].definitions[2].example[1].text":"I wasn’t feeling very well, so I called in sick (=telephoned to say I was too ill to come to work)."}