{"mileage.word":"mileage","mileage.translation[0].definitions[0].definition":"the number of miles a vehicle has travelled since it was made","mileage.translation[0].definitions[0].example[0].text":"Always check the mileage before you buy a secondhand car.","mileage.translation[0].definitions[1].definition":"the number of miles someone travels in a vehicle in a particular period of time","mileage.translation[0].definitions[1].example[0].text":"Look for a car hire agreement that offers unlimited mileage.","mileage.translation[0].definitions[2].definition":"the number of miles a vehicle can travel using a particular amount of fuel","mileage.translation[0].definitions[2].example[0].text":"The car’s average mileage is 22.73 miles per gallon.","mileage.translation[0].definitions[3].definition":"the amount of use or advantage you get from something","mileage.translation[0].definitions[3].example[0].text":"The newspapers wanted to get as much mileage from the story as they could.","mileage.translation[0].definitions[4].definition":"an amount of money that is paid to someone for each mile that they travel when they use their own car for work","mileage.translation[0].definitions[4].example[0].text":"Community nurses are paid a mileage allowance.","mileage.translation[0].definitions[5].definition":"the number of miles covered by a country’s roads or railways","mileage.translation[0].definitions[5].example[0].text":"plans to treble the country’s railway mileage","mileage.translation[1].definitions[0].definition":"an amount of money paid for each mile that is travelled by someone using a car for work","mileage.translation[1].definitions[0].example[0].text":"The mileage allowance for use of a personal car for business is up to 44 cents a mile.","mileage.translation[1].definitions[1].definition":"the amount of use or advantage that you get from something","mileage.translation[1].definitions[1].example[0].text":"Managers are working furiously on ways to get the most mileage out of the plan."}