{"reconstruction.word":"reconstruction","reconstruction.translation[0].definitions[0].definition":"the work that is done to repair the damage to a city, industry etc, especially after a war","reconstruction.translation[0].definitions[0].example[0].text":"the reconstruction of Western Europe after the war","reconstruction.translation[0].definitions[0].example[0].note.text":"reconstruction of","reconstruction.translation[0].definitions[1].definition":"a description or copy of an event or a place, which you produce by collecting information about it","reconstruction.translation[0].definitions[1].example[0].text":"Detectives want to stage a reconstruction of events.","reconstruction.translation[0].definitions[1].example[0].note.text":"reconstruction of","reconstruction.translation[0].definitions[1].example[1].text":"a reconstruction of a Roman villa","reconstruction.translation[0].definitions[1].example[1].note.text":"reconstruction of","reconstruction.translation[1].definitions[0].definition":"(1865–77) the period of American history after the Civil War when the southern states, under government and military control, rejoined the US. Slavery was abolished, African Americans were given the right to vote, and a few universities were established for African-American people. Many white southerners strongly opposed these measures and some formed the Ku Klux Klan.","reconstruction.translation[2].definitions[0].definition":"the work that is done after a war, EARTHQUAKE etc to repair the damage that was caused to buildings, industry etc","reconstruction.translation[2].definitions[0].example[0].text":"the post-war reconstruction of the country’s damaged infrastructure","reconstruction.translation[2].definitions[1].definition":"when a company changes the way its capital is organized, usually because of financial difficulties. This may be done, for example, by joining with another company or by forming a new company","reconstruction.translation[2].definitions[1].example[0].text":"It will not invest in any reconstruction of the failed Australian airline."}