{"audit.word":"audit","audit.translation[0].definitions[0].definition":"an official examination of a company’s financial records in order to check that they are correct","audit.translation[0].definitions[0].note.text":"internal audit (=an audit carried out by a company’s own staff)","audit.translation[0].definitions[0].example[0].text":"the annual audit","audit.translation[0].definitions[1].definition":"a detailed examination of something in order to check if it is good enough","audit.translation[0].definitions[1].example[0].text":"Start with an audit of existing services within the community.","audit.translation[1].definitions[0].definition":"to officially examine a company’s financial records in order to check that they are correct","audit.translation[1].definitions[1].definition":"to attend a course at university without intending to take examinations in it or get a credit for it","audit.translation[2].definitions[0].definition":"an official examination of a person’s or organization’s accounts by an expert, to check that they are true and honest","audit.translation[2].definitions[0].example[0].text":"An audit of the company showed accumulated losses of £1.5 billion.","audit.translation[2].definitions[0].example[1].text":"The accounts will need to have an independent audit before they can be submitted.","audit.translation[2].definitions[0].example[2].text":"We carry out a full internal audit once a year.","audit.translation[2].definitions[1].definition":"an examination of an organization’s activities or performance","audit.translation[2].definitions[1].example[0].text":"The prison population has risen by 2,500 in the last six months, according to a government audit.","audit.translation[2].definitions[1].example[1].text":"She wants the oil company to agree to an external audit of its environmental policies.","audit.translation[3].definitions[0].definition":"to officially check that an individual’s or organization’s accounts are true and honest","audit.translation[3].definitions[0].example[0].text":"To taxpayers who’ve been audited, the Internal Revenue Service is a frightening organization.","audit.translation[3].definitions[1].definition":"to check a particular part of an organization’s activities or performance","audit.translation[3].definitions[1].example[0].text":"When the cars it builds in Canada were audited, they were accepted as having the 50% North American content required under trade rules."}