{"sign on.word":"sign on","sign on.translation[0].definitions[0].definition":"to state officially that you are unemployed by signing a form, so that you can get money from the government","sign on.translation[0].definitions[1].definition":"to sign a document to show that you agree to work for someone","sign on.translation[0].definitions[1].example[0].text":"He signed on as a soldier in the US army.","sign on.translation[0].definitions[1].example[1].text":"I’ll probably have to sign on with a nursing agency.","sign on.translation[1].definitions[0].definition":"to go to your local job centre and sign a form which states officially that you are unemployed, so that you can get money from the government","sign on.translation[1].definitions[0].example[0].text":"Childcare Allowance is available only for married women whose children are over four years of age and who have been signing on for the previous six months.","sign on.translation[1].definitions[1].definition":"if you sign on, or sign someone on, you sign or persuade someone to sign a document agreeing to do something, for example accepting a job, studying on a course, or becoming involved in a business deal","sign on.translation[1].definitions[1].example[0].text":"Two more members of staff were signed on full-time.","sign on.translation[1].definitions[1].example[1].text":"Jacobs signed on as a junior attorney with a Santa Rosa law firm.","sign on.translation[1].definitions[1].example[2].text":"The corporation is deciding whether to sign on to a deal to build a new U.S. manufacturing plant to compete with the French.","sign on.translation[1].definitions[2].definition":"to start using a computer system, the Internet, or to go to a website","sign on.translation[1].definitions[2].example[0].text":"You’ll need to type in your password to sign on to the network.","sign on.translation[1].definitions[2].example[1].text":"The Internet has strange economics; individual users are charged for signing on, but can then surf the net for nothing."}