{"editor.word":"editor","editor.translation[0].definitions[0].definition":"the person who is in charge of a newspaper or magazine, or part of a newspaper or magazine, and decides what should be included in it","editor.translation[0].definitions[0].note.text":"economics/sports/political etc editor","editor.translation[0].definitions[0].example[0].text":"the editor of the Daily Telegraph","editor.translation[0].definitions[0].example[0].note.text":"editor of","editor.translation[0].definitions[1].definition":"someone who prepares a book or article for printing by deciding what to include and checking for any mistakes","editor.translation[0].definitions[2].definition":"someone who chooses what to include in a book on a particular subject","editor.translation[0].definitions[2].example[0].text":"the editor of a book of essays on modern poetry","editor.translation[0].definitions[3].definition":"someone who prepares a film, television programme, or sound recording for broadcasting by deciding what to include and checking for any mistakes","editor.translation[0].definitions[3].example[0].text":"a TV script editor","editor.translation[0].definitions[4].definition":"someone who reports on a particular subject for a radio or television news programme","editor.translation[0].definitions[4].example[0].text":"Here is John Simmonds, our Diplomatic Editor, with the latest news.","editor.translation[0].definitions[5].definition":"a computer program that allows you to make changes to saved information","editor.translation[1].definitions[0].definition":"the person who has responsibility for deciding what should be included in a newspaper or magazine","editor.translation[1].definitions[0].example[0].text":"Lawson had seen many financial scandals when working as a City Editor.","editor.translation[1].definitions[0].example[1].text":"the foreign editor of the New York Herald Tribune","editor.translation[1].definitions[0].example[2].text":"the Deputy Editor of the Arab Observer","editor.translation[1].definitions[1].definition":"a person who prepares a book for printing or a film for broadcasting by checking it and making changes to improve it","editor.translation[1].definitions[1].example[0].text":"She is an editor for a small publisher in Oxford.","editor.translation[1].definitions[2].definition":"a computer program that allows you to make changes to a piece of writing. An editor only allows you to change the writing in a document, not the way in which the writing will appear on the page when it is printed out"}