{"tick.word":"tick","tick.translation[0].definitions[0].definition":"if a clock or watch ticks, it makes a short repeated sound","tick.translation[0].definitions[0].example[0].text":"The old clock ticked noisily.","tick.translation[0].definitions[1].definition":"to mark a test, list of questions etc with a tick, in order to show that something is correct, to choose something etc","tick.translation[0].definitions[1].example[0].text":"Tick the description that best fits you.","tick.translation[0].definitions[1].example[1].text":"Just tick the box on your order form.","tick.translation[1].definitions[0].definition":"a mark (✓) written next to an answer, something on a list etc, to show that it is correct or has been dealt with","tick.translation[1].definitions[0].example[0].text":"Put a tick in the box if you agree with this statement.","tick.translation[1].definitions[1].definition":"a very small animal like an insect that lives under the skin of other animals and sucks their blood","tick.translation[1].definitions[2].definition":"the short repeated sound that a clock or watch makes every second","tick.translation[1].definitions[3].definition":"a very short time","tick.translation[1].definitions[3].synonym":"moment","tick.translation[1].definitions[3].example[0].text":"I’ll be with you in a tick (=soon).","tick.translation[1].definitions[3].example[1].text":"It’ll only take two ticks.","tick.translation[2].definitions[0].definition":"a mark that you put next to an answer to show that it is correct or against an item on a list to show that you have dealt with it","tick.translation[2].definitions[0].example[0].text":"Put a tick in the column that applies to you.","tick.translation[2].definitions[1].definition":"if you get something on tick, you arrange to take it now and pay for it later","tick.translation[2].definitions[2].definition":"an occasion when the price of a share, bond etc moves up or down","tick.translation[2].definitions[2].example[0].text":"He had the trades done near the close of the trading day on either a plus tick (=a price higher than the previous trade) or a  zero-plus tick (=an unchanged price following upward price movement).","tick.translation[2].definitions[3].definition":"in interest rates, bond prices etc one hundredth of one per cent","tick.translation[2].definitions[3].example[0].text":"The price of the December Eurodollar future quickly rose four ticks, from 94.15 to 94.19.","tick.translation[3].definitions[0].definition":"to make a mark next to an answer or something on a list to show that it is correct or has been dealt with","tick.translation[3].definitions[0].example[0].text":"Which of the following features do you feel are important when choosing a bed? (Please tick all that apply)."}