{"function.word":"function","function.translation[0].definitions[0].definition":"the purpose that something has, or the job that someone or something does","function.translation[0].definitions[0].example[0].text":"The nervous system regulates our bodily functions (=eating, breathing, going to the toilet etc).","function.translation[0].definitions[0].example[1].text":"Bauhaus architects thought that function was more important than form.","function.translation[0].definitions[0].example[2].text":"In your new job you will perform a variety of functions.","function.translation[0].definitions[0].example[2].note.text":"perform/fulfil a function","function.translation[0].definitions[0].example[3].text":"The church fulfils a valuable social function.","function.translation[0].definitions[0].example[3].note.text":"perform/fulfil a function","function.translation[0].definitions[1].definition":"a large party or official event","function.translation[0].definitions[1].example[0].text":"This room may be hired for weddings and other functions.","function.translation[0].definitions[2].definition":"a quantity or quality whose value changes according to another quantity or quality that is related to it","function.translation[0].definitions[2].example[0].text":"The degree of drought is largely a function of temperature and drainage.","function.translation[0].definitions[3].definition":"one of the basic operations performed by a computer","function.translation[1].definitions[0].definition":"to work in the correct or intended way","function.translation[1].definitions[0].synonym":"operate","function.translation[1].definitions[0].example[0].text":"Her legs have now ceased to function.","function.translation[1].definitions[0].example[1].text":"You know I can’t function (=cannot perform normal activities) without a coffee in the morning.","function.translation[1].definitions[0].example[2].text":"Flights in and out of Taipei are functioning normally again.","function.translation[1].definitions[0].example[2].note.text":"function normally/correctly/properly etc","function.translation[1].definitions[0].note_box.items[0].explanation":"In everyday English, people usually say that something works rather than functions:","function.translation[1].definitions[0].note_box.items[0].example[0].text":"If the system is working as it should, you’ll be paid within two weeks.","function.translation[1].definitions[1].definition":"if something functions in a particular way, it works in that way","function.translation[1].definitions[1].example[0].text":"an understanding of how the economy functions","function.translation[2].definitions[0].definition":"the purpose for which something is made or used, or the job that someone does","function.translation[2].definitions[0].synonym":"ROLE","function.translation[2].definitions[0].example[0].text":"The main function of a cash-machine is to provide people with cash when the bank is shut.","function.translation[2].definitions[0].example[1].text":"He was once asked what he considered the function of a chairman to be.","function.translation[2].definitions[0].example[2].text":"In your new job you will be expected to perform many differentfunctions.","function.translation[2].definitions[0].example[3].text":"For accounting purposes the Bank’s function as the issuer of currency notes is shown separately from its banking activities.","function.translation[2].definitions[1].definition":"the way in which something works or operates, or the way in which it is used","function.translation[2].definitions[1].example[0].text":"People buy design rather than function; otherwise why bother to design a beer can? The beer stays the same.","function.translation[2].definitions[2].definition":"the part of a company that is responsible for sales, accounting etc","function.translation[2].definitions[2].example[0].text":"Why do companies use headhunters instead of their own in-house recruiting facilities and personnel function?","function.translation[2].definitions[2].example[1].text":"The more efficient a company’s accounting function might be, the less time it should take to do the audit.","function.translation[2].definitions[3].definition":"an operation or series of operations performed by a computer or a computer program","function.translation[2].definitions[3].example[0].text":"You press the Ins key once to turn on a function and press it again to turn off the same function.","function.translation[2].definitions[4].definition":"if one thing is a function of another, it is produced by or varies according to the other thing","function.translation[2].definitions[4].example[0].text":"The unit price at any time is a function of the prevailing interest rates and the risk involved.","function.translation[2].definitions[4].example[1].text":"For marketing purposes, purchases by customers are assumed to be a function of advertising and promotional expenditure.","function.translation[3].definitions[0].definition":"to work or operate","function.translation[3].definitions[0].example[0].text":"Can you explain exactly how this new system will function?","function.translation[3].definitions[0].example[1].text":"Different types of organizations will require differing types of budgets to enable them to function effectively.","function.translation[3].definitions[0].example[2].text":"A manager should identify and resolve factors stopping a member of staff from functioning properly.","function.translation[3].definitions[1].definition":"if a machine or system functions, it works or operates in the way that it is supposed to","function.translation[3].definitions[1].example[0].text":"We usually run tests to check that the air conditioning system is functioning properly.","function.translation[3].definitions[1].example[1].text":"Hospitals function in spite of the system, but only because of the enormous professional devotion of their staffs."}