{"sell something ↔ off.word":"sell something ↔ off","sell something ↔ off.translation[0].definitions[0].definition":"to sell something, especially for a cheap price, because you need the money or because you want to get rid of it","sell something ↔ off.translation[0].definitions[0].example[0].text":"After the war, we had to sell off part of the farm.","sell something ↔ off.translation[0].definitions[0].example[1].text":"We sell off leftover cakes before we close.","sell something ↔ off.translation[0].definitions[1].definition":"to sell all or part of an industry or company","sell something ↔ off.translation[0].definitions[1].example[0].text":"The Leicestershire company has sold off many of its smaller branches to cut debts.","sell something ↔ off.translation[1].definitions[0].definition":"the sale of an industry that the government owns, to private companies or other people","sell something ↔ off.translation[1].definitions[1].definition":"the sale of a lot of stocks or shares, which makes the price decrease","sell something ↔ off.translation[2].definitions[0].definition":"to sell all or most of an industry, company, business etc, usually at a low price","sell something ↔ off.translation[2].definitions[0].example[0].text":"He plans to break the company up and sell it off as several independent businesses.","sell something ↔ off.translation[2].definitions[0].example[1].text":"The privatization of state enterprises will be delayed until they can be sold off at a better price.","sell something ↔ off.translation[3].definitions[0].definition":"a situation in which many investors sell their bonds, shares etc, often very quickly","sell something ↔ off.translation[3].definitions[0].example[0].text":"In an otherwise calm market, there were steep sell-offs in shares.","sell something ↔ off.translation[3].definitions[1].definition":"when a business, company etc is sold to another company","sell something ↔ off.translation[3].definitions[1].example[0].text":"6,000 metal union workers occupied two shipbuilding companies to protest at their planned sell-offs."}