{"weaken.word":"weaken","weaken.translation[0].definitions[0].definition":"to make someone or something less powerful or less important, or to become less powerful","weaken.translation[0].definitions[0].opposite":"strengthen","weaken.translation[0].definitions[0].example[0].text":"Over the last two years the president’s position has weakened.","weaken.translation[0].definitions[0].example[1].text":"Changes in policy have weakened the power of the trade unions.","weaken.translation[0].definitions[0].example[2].text":"The absence of this witness has weakened the case against the accused.","weaken.translation[0].definitions[1].definition":"to make someone lose their physical strength, or to become physically weak","weaken.translation[0].definitions[1].example[0].text":"Julia was weakened by her long illness.","weaken.translation[0].definitions[2].definition":"to make someone less determined, or to become less determined","weaken.translation[0].definitions[2].example[0].text":"Such policies weaken the resolve of potential troublemakers.","weaken.translation[0].definitions[2].example[1].text":"When she begged him to let her stay, he weakened.","weaken.translation[0].definitions[3].definition":"to make a building, structure etc less strong, or to become less strong","weaken.translation[0].definitions[3].example[0].text":"The earthquake in Cairo weakened a number of structures.","weaken.translation[0].definitions[4].definition":"if a particular country’s money or a company’s share prices weaken, or if they are weakened, their value is reduced","weaken.translation[0].definitions[4].example[0].text":"The pound has weakened against the dollar.","weaken.translation[0].definitions[4].example[0].note.text":"weaken against","weaken.translation[1].definitions[0].definition":"if investments, prices, currencies etc weaken, or something weakens them, they begin to fall in value","weaken.translation[1].definitions[0].example[0].text":"A combination of low US interest rates and a rising Euro will weaken the dollar.","weaken.translation[1].definitions[0].example[1].text":"Work stoppages will cause an alreadyweakening economy to slow further.","weaken.translation[1].definitions[0].example[2].text":"London shares weakened, while Frankfurt stocks finished strong.","weaken.translation[1].definitions[1].definition":"to make something less powerful, successful, or profitable","weaken.translation[1].definitions[1].example[0].text":"Further weakened by the recession, the airline filed for bankruptcy.","weaken.translation[1].definitions[1].example[1].text":"Many agencies fear that revealing the use of subcontractors may weaken their reputations as full-service shops."}