{"fulfilment.word":"fulfilment","fulfilment.translation[0].definitions[0].definition":"the feeling of being happy and satisfied with your life because you are doing interesting, useful, or important things","fulfilment.translation[0].definitions[0].example[0].text":"Are you looking for greater fulfillment and satisfaction in your work?","fulfilment.translation[0].definitions[0].example[1].text":"a deep sense of fulfilment that makes life worthwhile","fulfilment.translation[0].definitions[0].example[2].text":"The real joy of the priesthood is helping people find personal fulfilment.","fulfilment.translation[0].definitions[0].example[2].note.text":"seek/find fulfilment","fulfilment.translation[0].definitions[1].definition":"when something you wanted happens or is given to you","fulfilment.translation[0].definitions[1].synonym":"achievement","fulfilment.translation[0].definitions[1].example[0].text":"the fulfillment of a long-held dream","fulfilment.translation[0].definitions[1].example[0].note.text":"fulfilment of","fulfilment.translation[0].definitions[2].definition":"the act of doing something that you promised or agreed to do","fulfilment.translation[0].definitions[2].example[0].text":"People are wondering if they will ever see the fulfillment of the government’s campaign pledges.","fulfilment.translation[0].definitions[2].example[0].note.text":"fulfilment of a promise/duty/condition etc","fulfilment.translation[1].definitions[0].definition":"fulfilment of a hope, promise etc is when the thing that you had hoped for, promised etc happens or is done","fulfilment.translation[1].definitions[0].example[0].text":"Receiving the award was the fulfillment of a life-long ambition.","fulfilment.translation[1].definitions[1].definition":"the action of supplying the things that have been ordered","fulfilment.translation[1].definitions[1].example[0].text":"He ordered a stop to the unauthorized use of produce already allocated for fulfillment of state orders.","fulfilment.translation[1].definitions[2].definition":"when you do in a satisfactory way the things that a contract says you must do","fulfilment.translation[1].definitions[2].example[0].text":"The clearing house guarantees fulfilment of all contracts by becoming a party to every transaction.","fulfilment.translation[1].definitions[3].definition":"the action of reaching a standard that is necessary, especially one that has been officially decided","fulfilment.translation[1].definitions[3].example[0].text":"The offer of this contract is subject to the fulfilment of certain conditions.","fulfilment.translation[1].definitions[3].example[1].text":"The Bundesbank said that the fulfillment of conditions of economic convergence between EU countries should not be linked to a specific time frame.","fulfilment.translation[1].definitions[4].definition":"an occasion when something that is wanted, needed etc happens or is given","fulfilment.translation[1].definitions[4].example[0].text":"The effective leader must perform two functions successfully, namely the achievement of the task which has been set and the fulfilment of colleagues’ needs.","fulfilment.translation[1].definitions[5].definition":"when people, organizations, or machines do the things they must do or are expected to do","fulfilment.translation[1].definitions[5].example[0].text":"The fulfilment of the Bank’s public duty overrides its duty of confidence to their customers.","fulfilment.translation[1].definitions[6].definition":"when you achieve what you were hoping to do","fulfilment.translation[1].definitions[6].example[0].text":"He focussed all the team’s efforts towards the fulfillment of strategic goals.","fulfilment.translation[1].definitions[6].example[1].text":"This aid money is crucial to the fulfilment of the government’s economic policies.","fulfilment.translation[1].definitions[7].definition":"the feeling of being satisfied, especially in your job, because you are using all your skills and qualities","fulfilment.translation[1].definitions[7].example[0].text":"He gained great fulfillment from teaching and training others for the profession.","fulfilment.translation[1].definitions[7].example[1].text":"Working on a conveyor belt does little for a sense of personal fulfilment."}