{"abandon.word":"abandon","abandon.translation[0].definitions[0].definition":"to leave someone, especially someone you are responsible for","abandon.translation[0].definitions[0].example[0].text":"How could she abandon her own child?","abandon.translation[0].definitions[1].definition":"to go away from a place, vehicle etc permanently, especially because the situation makes it impossible for you to stay","abandon.translation[0].definitions[1].example[0].text":"We had to abandon the car and walk the rest of the way.","abandon.translation[0].definitions[1].example[1].text":"Fearing further attacks, most of the population had abandoned the city.","abandon.translation[0].definitions[2].definition":"to stop doing something because there are too many problems and it is impossible to continue","abandon.translation[0].definitions[2].example[0].text":"The game had to be abandoned due to bad weather.","abandon.translation[0].definitions[2].example[1].text":"They abandoned their attempt to recapture the castle.","abandon.translation[0].definitions[2].example[2].text":"Because of the fog they abandoned their idea of driving.","abandon.translation[0].definitions[3].definition":"to stop having a particular idea, belief, or attitude","abandon.translation[0].definitions[3].example[0].text":"They were accused of abandoning their socialist principles.","abandon.translation[0].definitions[3].example[1].text":"Rescuers had abandoned all hope of finding any more survivors.","abandon.translation[1].definitions[0].definition":"if someone does something with abandon, they behave in a careless or uncontrolled way, without thinking or caring about what they are doing","abandon.translation[1].definitions[0].example[0].text":"They drank and smoked with reckless abandon.","abandon.translation[1].definitions[0].example[0].note.text":"with reckless/wild abandon","abandon.translation[2].definitions[0].definition":"to stop doing or using something because it is too difficult or unsuccessful","abandon.translation[2].definitions[0].example[0].text":"The company abandoned its takeover bid.","abandon.translation[2].definitions[0].example[1].text":"The power plant was abandoned before it was even completed.","abandon.translation[2].definitions[1].definition":"if you abandon a ship or its cargo, you accept that it is too badly damaged to be saved, and so give it up to an insurance company in exchange for an insurance payment","abandon.translation[2].definitions[2].definition":"to leave an organization because you believe that it is going to fail soon","abandon.translation[2].definitions[2].example[0].text":"The chairman and most of the board members had already abandoned ship.","abandon.translation[2].definitions[3].definition":"to no longer continue with a legal case etc","abandon.translation[2].definitions[3].example[0].text":"They decided to abandon their claim for damages."}