{"freight.word":"freight","freight.translation[0].definitions[0].definition":"goods that are carried by ship, train, or aircraft, and the system of moving these goods","freight.translation[0].definitions[0].example[0].text":"freight services","freight.translation[0].definitions[0].example[1].text":"We’ll send your personal belongings by air freight and your furniture by sea freight.","freight.translation[0].definitions[1].definition":"a freight train","freight.translation[1].definitions[0].definition":"to send goods by air, sea, or train","freight.translation[2].definitions[0].definition":"goods carried in large quantities by ship, plane, train etc","freight.translation[2].definitions[0].example[0].text":"A 747 can carry freight as well as passengers.","freight.translation[2].definitions[0].example[1].text":"The volume of rail freight is only 8% of the rail-and-road total.","freight.translation[2].definitions[0].example[2].text":"The Panama Canal has lost some of its importance because of air freight.","freight.translation[2].definitions[0].example[3].text":"The railroad is now only used by freight trains.","freight.translation[2].definitions[0].example[4].text":"afreight car (=a wagon pulled by a train in which freight is carried)","freight.translation[2].definitions[1].definition":"the cost of carrying goods in large quantities by ship, plane, train etc","freight.translation[2].definitions[1].example[0].text":"The goods had been loaded on board the vessel and freight had been paid.","freight.translation[2].definitions[1].example[1].text":"The railways adopted a negative attitude to the milk trade, refusing to grant concessionaryfreight rates.","freight.translation[2].definitions[2].definition":"used on the debit side of the profit and loss account to show that payments are for the cost of transporting goods a company has bought","freight.translation[3].definitions[0].definition":"to TRANSPORT goods in large quantities by ship, plane, train etc","freight.translation[3].definitions[0].example[0].text":"There was no time to send the equipment by ship, so it was freighted in a B747F aircraft."}