{"creative.word":"creative","creative.translation[0].definitions[0].definition":"involving the use of imagination to produce new ideas or things","creative.translation[0].definitions[0].example[0].text":"This job is so boring. I wish I could do something more creative.","creative.translation[0].definitions[0].example[1].text":"I teach creative writing at Trinity College.","creative.translation[0].definitions[0].example[2].text":"the creative process of writing a poem","creative.translation[0].definitions[0].example[3].text":"Diaghilev did his great creative work in France.","creative.translation[0].definitions[0].example[4].text":"a creative solution to the problem","creative.translation[0].definitions[1].definition":"someone who is creative is very good at using their imagination to make things","creative.translation[0].definitions[1].example[0].text":"You’re so creative! I could never make my own clothes.","creative.translation[1].definitions[0].definition":"someone such as a writer or artist who uses their imagination or skills to make things","creative.translation[2].definitions[0].definition":"producing or using new and interesting ideas","creative.translation[2].definitions[0].example[0].text":"The movie company has come under criticism for focusing too heavily on marketing and not enough on creative issues.","creative.translation[2].definitions[0].example[1].text":"He regularly gives lectures and classes on creative thinking.","creative.translation[2].definitions[1].definition":"relating to the work of producing advertisements etc at an ADVERTISING AGENCY, rather than management of the agency","creative.translation[2].definitions[1].example[0].text":"She is leaving the agency to take a senior creative position elsewhere.","creative.translation[3].definitions[0].definition":"someone working for a company that produces books, advertisements, or films, whose job involves writing, drawing, or having new ideas, and who does not have to wear a suit or neat clothes when they are at work"}